LoadTest/SingleProcess/school1_lec_3_students_chat.txt
Started phase 0, duration: 50s @ 03:06:53(+0530) 2021-08-08
Report @ 03:07:03(+0530) 2021-08-08
Elapsed time: 14 seconds
  Scenarios launched:  9
  Scenarios completed: 0
  Requests completed:  43
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.6
    median: 0
    p95: 0.3
    p99: 0.6
  Codes:
    0: 43
  engine.socketio.emit: 43

Report @ 03:07:13(+0530) 2021-08-08
Elapsed time: 24 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  51
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.7
    median: 0.1
    p95: 0.5
    p99: 0.7
  Codes:
    0: 51
  engine.socketio.emit: 51

Report @ 03:07:23(+0530) 2021-08-08
Elapsed time: 34 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  60
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 2.6
    median: 0.1
    p95: 0.5
    p99: 2.4
  Codes:
    0: 60
  engine.socketio.emit: 60

Report @ 03:07:33(+0530) 2021-08-08
Elapsed time: 44 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  66
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.6
    median: 0.1
    p95: 0.5
    p99: 0.6
  Codes:
    0: 66
  engine.socketio.emit: 66

Report @ 03:07:43(+0530) 2021-08-08
Elapsed time: 54 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  75
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.3
    median: 0.2
    p95: 0.4
    p99: 1.3
  Codes:
    0: 75
  engine.socketio.emit: 75

Report @ 03:07:53(+0530) 2021-08-08
Elapsed time: 1 minute, 4 seconds
  Scenarios launched:  1
  Scenarios completed: 0
  Requests completed:  39
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.6
    median: 0.3
    p95: 0.5
    p99: 0.6
  Codes:
    0: 39
  engine.socketio.emit: 39

Report @ 03:08:03(+0530) 2021-08-08
Elapsed time: 1 minute, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:08:13(+0530) 2021-08-08
Elapsed time: 1 minute, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 2.1
    median: 0.3
    p95: 0.7
    p99: 2.1
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:08:23(+0530) 2021-08-08
Elapsed time: 1 minute, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:08:33(+0530) 2021-08-08
Elapsed time: 1 minute, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:08:43(+0530) 2021-08-08
Elapsed time: 1 minute, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.9
    median: 0.3
    p95: 1.1
    p99: 1.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:08:53(+0530) 2021-08-08
Elapsed time: 2 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 2.4
    median: 0.4
    p95: 1.9
    p99: 2.4
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:03(+0530) 2021-08-08
Elapsed time: 2 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:13(+0530) 2021-08-08
Elapsed time: 2 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.9
    median: 0.3
    p95: 0.9
    p99: 2.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:23(+0530) 2021-08-08
Elapsed time: 2 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.5
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:33(+0530) 2021-08-08
Elapsed time: 2 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.3
    median: 0.3
    p95: 0.7
    p99: 2.3
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:43(+0530) 2021-08-08
Elapsed time: 2 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.8
    median: 0.3
    p95: 0.8
    p99: 1.8
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:09:53(+0530) 2021-08-08
Elapsed time: 3 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 5
    median: 0.3
    p95: 1.4
    p99: 5
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:03(+0530) 2021-08-08
Elapsed time: 3 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.9
    median: 0.3
    p95: 0.5
    p99: 0.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:13(+0530) 2021-08-08
Elapsed time: 3 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.9
    median: 0.3
    p95: 0.6
    p99: 2.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:23(+0530) 2021-08-08
Elapsed time: 3 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.1
    median: 0.2
    p95: 0.6
    p99: 3.1
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:33(+0530) 2021-08-08
Elapsed time: 3 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.2
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:43(+0530) 2021-08-08
Elapsed time: 3 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.2
    p95: 0.5
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:10:53(+0530) 2021-08-08
Elapsed time: 4 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.6
    median: 0.3
    p95: 0.8
    p99: 1.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:03(+0530) 2021-08-08
Elapsed time: 4 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3
    median: 0.2
    p95: 1.6
    p99: 3
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:13(+0530) 2021-08-08
Elapsed time: 4 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.3
    median: 0.2
    p95: 0.5
    p99: 1.3
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:23(+0530) 2021-08-08
Elapsed time: 4 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:33(+0530) 2021-08-08
Elapsed time: 4 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.9
    median: 0.3
    p95: 0.5
    p99: 2.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:43(+0530) 2021-08-08
Elapsed time: 4 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.2
    median: 0.2
    p95: 0.5
    p99: 3.2
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:11:53(+0530) 2021-08-08
Elapsed time: 5 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.5
    median: 0.2
    p95: 0.4
    p99: 0.5
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:12:03(+0530) 2021-08-08
Elapsed time: 5 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 9
  Requests completed:  28
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3
    median: 0.3
    p95: 0.8
    p99: 3
  Codes:
    0: 28
  engine.socketio.emit: 28

Report @ 03:12:13(+0530) 2021-08-08
Elapsed time: 5 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  24
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.1
    median: 0.3
    p95: 1.7
    p99: 3.1
  Codes:
    0: 24
  engine.socketio.emit: 24

Report @ 03:12:23(+0530) 2021-08-08
Elapsed time: 5 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  15
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.2
    p95: 0.6
    p99: 0.6
  Codes:
    0: 15
  engine.socketio.emit: 15

Report @ 03:12:33(+0530) 2021-08-08
Elapsed time: 5 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  9
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.5
    median: 0.3
    p95: 0.5
    p99: 0.5
  Codes:
    0: 9
  engine.socketio.emit: 9

Report @ 03:12:43(+0530) 2021-08-08
Elapsed time: 5 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 03:12:43(+0530) 2021-08-08
Elapsed time: 5 minutes, 55 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 03:12:43(+0530) 2021-08-08
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  1250
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 5
    median: 0.2
    p95: 0.6
    p99: 2.3
  Scenario counts:
    Students with lecture doubts: 35 (70%)
    Silent students: 15 (30%)
  Codes:
    0: 1250
  engine.socketio.emit: 1250